[Rainmeter]
Update=1000
AccurateText=1
DynamicWindowSize=1

[Variables]
; --- 【1. 日期设置】在此增减 TargetX 和 EventLabelX (编号需连续) ---
Target1=2026-01-01 00:00:00
EventLabel1=距离 NEW YEAR

Target2=2025-01-29 00:00:00
EventLabel2=距离 春节

Target3=2025-06-20 00:00:00
EventLabel3=距离 毕业

; --- 【2. 视觉配置】修改颜色、字体和大小 ---
BgColor=30,35,45,220
TextColor=245,245,245,255
SeparatorColor=245,245,245,80
FontEN=Georgia
FontCN=Source Han Serif SC VF
FontSize=24

; --- 【3. 逻辑驱动】 ---
[MeasureLua]
Measure=Script
ScriptFile=Countdown.lua

; =============================================
; 样式模板 (控制外观，通常无需修改)
; =============================================

[StyleLabel]
FontSize=16
FontColor=#TextColor#
FontWeight=700
AntiAlias=1
X=120
Y=20R
StringAlign=Center
StringCase=Upper
CharacterSpacing=1.2
FontFace=#FontEN#
InlineSetting=Face | #FontCN#
InlinePattern=[^\x00-\x7F]

[StyleDivider]
Shape=Line 70,0,170,0 | Stroke Color #TextColor#, 150 | Stroke Width 2
X=0
Y=5R

[StyleCountdown]
FontSize=#FontSize#
FontColor=#TextColor#
FontStyle=Italic
AntiAlias=1
X=120
Y=2R
StringAlign=Center
FontFace=#FontEN#
InlineSetting=Face | #FontCN#
InlinePattern=[^\x00-\x7F]
InlineSetting2=Color | #SeparatorColor#
InlinePattern2=/
DynamicVariables=1

; =============================================
; 显示模块 (增加事件请复制下方块)
; =============================================

; 自动背景：高度随事件数量自动伸缩
[MeterBackground]
Meter=Shape
Shape=Rectangle 0,0,240,([MeterAnchor:Y]+15),10 | Fill Color #BgColor# | Stroke Width 0
DynamicVariables=1

; --- 事件 1 ---
[MeterLabel1]
Meter=String
MeterStyle=StyleLabel
Text=#EventLabel1#
Y=12

[MeterDivider1]
Meter=Shape
MeterStyle=StyleDivider

[MeterCountdown1]
Meter=String
MeterStyle=StyleCountdown
Text="#ResM1#/#ResW1#/#ResD1#"

; --- 事件 2 ---
[MeterLabel2]
Meter=String
MeterStyle=StyleLabel
Text=#EventLabel2#

[MeterDivider2]
Meter=Shape
MeterStyle=StyleDivider

[MeterCountdown2]
Meter=String
MeterStyle=StyleCountdown
Text="#ResM2#/#ResW2#/#ResD2#"

; --- 事件 3 ---
[MeterLabel3]
Meter=String
MeterStyle=StyleLabel
Text=#EventLabel3#

[MeterDivider3]
Meter=Shape
MeterStyle=StyleDivider

[MeterCountdown3]
Meter=String
MeterStyle=StyleCountdown
Text="#ResM3#/#ResW3#/#ResD3#"

; --- 底部锚点：用于自动撑开背景高度 (请保持在最后) ---
[MeterAnchor]
Meter=String
Y=0R
Text=""
